app/views/brackets/_bracket.html.erb

SELECT "matchups".* FROM "matchups" WHERE "matchups"."region" = $1 ORDER BY "matchups"."created_at" ASC  [["region", "West A"]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" ASC LIMIT $2  [["matchup_id", 9], ["LIMIT", 1]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" DESC LIMIT $2  [["matchup_id", 9], ["LIMIT", 1]]
---
<div class="accordion" id="accordion<%= region %>">
  <% bracket.matchups_by_region(region).each do |matchup| %>
    <% first_chef = matchup.chefs.first %>
    <% second_chef = matchup.chefs.last %>