app/views/brackets/show.html.erb

SELECT "matchups".* FROM "matchups" INNER JOIN "matchup_chefs" ON "matchup_chefs"."matchup_id" = "matchups"."id" INNER JOIN "chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchups"."bracket_id" = $1 AND (chefs.region = 'West')  [["bracket_id", 3]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" ASC LIMIT $2  [["matchup_id", 5], ["LIMIT", 1]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" DESC LIMIT $2  [["matchup_id", 5], ["LIMIT", 1]]
---
  <div class="accordion" id="accordionWest">
    <% @bracket.matchups_by_region('West').each do |matchup| %>
      <% first_chef = matchup.chefs.first %>
      <% second_chef = matchup.chefs.last %>

SELECT "matchups".* FROM "matchups" INNER JOIN "matchup_chefs" ON "matchup_chefs"."matchup_id" = "matchups"."id" INNER JOIN "chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchups"."bracket_id" = $1 AND (chefs.region = 'East')  [["bracket_id", 3]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" ASC LIMIT $2  [["matchup_id", 1], ["LIMIT", 1]]
SELECT "chefs".* FROM "chefs" INNER JOIN "matchup_chefs" ON "chefs"."id" = "matchup_chefs"."chef_id" WHERE "matchup_chefs"."matchup_id" = $1 ORDER BY "chefs"."id" DESC LIMIT $2  [["matchup_id", 1], ["LIMIT", 1]]
---
  <div class="accordion" id="accordionEast">
    <% @bracket.matchups_by_region('East').each do |matchup| %>
      <% first_chef = matchup.chefs.first %>
      <% second_chef = matchup.chefs.last %>