app/views/leagues/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "league_users" ON "users"."id" = "league_users"."user_id" WHERE "league_users"."league_id" = $1  [["league_id", 1]]
---
  <ul class="list-group">
    <% @league.users.each do |user| %>

SELECT "brackets".* FROM "brackets" WHERE "brackets"."user_id" = $1 AND "brackets"."league_id" = $2 ORDER BY "brackets"."id" ASC LIMIT $3  [["user_id", 1], ["league_id", 1], ["LIMIT", 1]]
---

  <% if current_user.league_bracket(@league).present? %>