app/controllers/brackets_controller.rb

INSERT INTO "brackets" ("user_id", "league_id", "template_bracket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["league_id", 1], ["template_bracket_id", 1], ["created_at", "2024-02-16 05:45:26.300360"], ["updated_at", "2024-02-16 05:45:26.300360"]]
---
  def create
    @bracket = Bracket.new(bracket_params)

    respond_to do |format|
      if @bracket.save

SELECT "brackets".* FROM "brackets" WHERE "brackets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_bracket
      @bracket = Bracket.find(params[:id])