app/controllers/chefs_controller.rb

SELECT "chefs".* FROM "chefs"
---
  def index
    @chefs = Chef.all