app/controllers/leagues_controller.rb

  def index
    @leagues = current_user.present? ?  current_user.leagues : League.all
---
SELECT "leagues".* FROM "leagues" INNER JOIN "league_users" ON "leagues"."id" = "league_users"."league_id" WHERE "league_users"."user_id" = $1  [["user_id", 1]]

  def create
    @league = League.new(league_params)

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test"], ["created_at", "2024-01-28 23:17:05.911947"], ["updated_at", "2024-01-28 23:17:05.911947"]]

    def set_league
      @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]