app/controllers/league_users_controller.rb

INSERT INTO "league_users" ("league_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["league_id", 1], ["user_id", 1], ["created_at", "2024-02-02 23:15:35.563334"], ["updated_at", "2024-02-02 23:15:35.563334"]]
---
  def create
    @league_user = LeagueUser.new(league_user_params)
    respond_to do |format|
      if @league_user.save

SELECT "users".* FROM "users" WHERE (email ILIKE NULL) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def set_league_user
      @league_user = LeagueUser.find(params[:id])