app/controllers/matchup_selections_controller.rb

UPDATE "matchup_selections" SET "winner_id" = $1, "updated_at" = $2 WHERE "matchup_selections"."id" = $3  [["winner_id", 1], ["updated_at", "2024-02-16 06:18:44.737861"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @matchup_selection.update(matchup_selection_params)

SELECT "matchup_selections".* FROM "matchup_selections" WHERE "matchup_selections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_matchup_selection
      @matchup_selection = MatchupSelection.find(params[:id])