app/controllers/matchups_controller.rb

UPDATE "matchups" SET "winner_id" = $1, "updated_at" = $2 WHERE "matchups"."id" = $3  [["winner_id", 16], ["updated_at", "2024-02-04 16:49:16.043016"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @matchup.update(matchup_params)

SELECT "matchups".* FROM "matchups" WHERE "matchups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_matchup
      @matchup = Matchup.find(params[:id])