app/models/league_user.rb

  def populate_email_user
    return unless email.present? && user.nil?
    user = User.where(email: email).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "cerebralstorm@gmail.com"], ["LIMIT", 1]]