app/models/league.rb

  def add_owner_as_league_user
    league_users.where(user_id: owner_id).first_or_create!
---
INSERT INTO "league_users" ("league_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["league_id", 1], ["user_id", 1], ["created_at", "2024-02-04 16:34:19.477956"], ["updated_at", "2024-02-04 16:34:19.477956"]]