app/models/template_bracket.rb

  def self.current
    where(active: true).first
---
SELECT "template_brackets".* FROM "template_brackets" WHERE "template_brackets"."active" = $1 ORDER BY "template_brackets"."id" ASC LIMIT $2  [["active", true], ["LIMIT", 1]]