app/models/user.rb

INSERT INTO "matchup_selections" ("user_id", "bracket_id", "matchup_id", "winner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["bracket_id", 1], ["matchup_id", 8], ["winner_id", nil], ["created_at", "2024-02-16 06:11:16.391393"], ["updated_at", "2024-02-16 06:11:16.391393"]]
---
  def matchup_selection(matchup, bracket)
    matchup_selections.where(matchup: matchup, bracket: bracket).first_or_create