app/bracket_templates/template2024.rb

  def create_bracket
    east1 = [
      { name: 'Kelsey Barnard Clark', region: 'East' },
      { name: 'Jose Garces', region: 'East' }
    ]

    east2 = [
      { name: 'Stephanie Izard', region: 'East' },
      { name: 'Marc Murphy', region: 'East' }
    ]

    west1 = [
      { name: 'Carlos Anthony',  region: 'West' },
      { name: 'Shirley Chung', region: 'West' }
    ]

    west2 = [
      { name: 'Mei Lin', region: 'West' },
      { name: 'Antonia Lofaso', region: 'West' }
    ]

    matchups = [east1, east2, west1, west2]
    bracket = user.brackets.last || Bracket.create(user: user)

    matchups.each do |chefs|
      matchup = Matchup.create!(bracket_id: bracket.id)
      chefs.each do |chef|
        current_chef = Chef.where(name: chef[:name]).first
        matchup.matchup_chefs.where(chef_id: current_chef.id).first_or_create!
---
SELECT "brackets".* FROM "brackets" WHERE "brackets"."user_id" = $1 ORDER BY "brackets"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "matchups" ("bracket_id", "winner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bracket_id", 1], ["winner_id", nil], ["created_at", "2024-02-04 16:31:40.468073"], ["updated_at", "2024-02-04 16:31:40.468073"]]
SELECT "chefs".* FROM "chefs" WHERE "chefs"."name" = $1 ORDER BY "chefs"."id" ASC LIMIT $2  [["name", "Kelsey Barnard Clark"], ["LIMIT", 1]]
INSERT INTO "matchup_chefs" ("matchup_id", "chef_id", "seed", "integer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["matchup_id", 3], ["chef_id", 1], ["seed", nil], ["integer", nil], ["created_at", "2024-02-02 23:20:28.042062"], ["updated_at", "2024-02-02 23:20:28.042062"]]
SELECT "matchup_chefs".* FROM "matchup_chefs" WHERE "matchup_chefs"."matchup_id" = $1 AND "matchup_chefs"."chef_id" = $2 ORDER BY "matchup_chefs"."id" ASC LIMIT $3  [["matchup_id", 3], ["chef_id", 1], ["LIMIT", 1]]